{
    "quote": "Curiosity and a positive attitude can take you places!",
    "bio": "Hello and welcome. I’m <b>Aless HOSRY</b>, a research engineer specialised in software analysis. I invite you to browse through my website to learn more about my professional journey, explore my portfolio, and connect with me on social media. Let’s connect and collaborate to create something meaningful.",
    "educationIntro": "My academic path in computer science includes degrees that built a strong foundation in engineering and research. I also developed fluency in French and English, studying in French universities and conducting research entirely in English: writing papers, reviewing literature, and presenting at international conferences.",
    "education": [
        {
            "title": "PhD in Computer Science (2021 - 2024)",
            "institute": "University of Lille",
            "location": "Lille, France",
            "description": "I completed my PhD in Computer Science, specializing in External Dependencies, as part of the <a href='https://www.inria.fr/fr/evref' target='_blank' >EVREF</a> team at <a href='https://www.inria.fr/fr/centre-inria-de-luniversite-de-lille' target='_blank'>INRIA Lille</a>. My research focused on detecting and analyzing external dependencies in heterogeneous software systems, resulting in several published papers and presentations at international conferences. This experience enhanced my technical expertise and reinforced my ability to independently tackle complex research challenges."
        },
        {
            "title": "Engineering Degree (2017 - 2019)",
            "institute": "Le CNAM",
            "location": "Beirut, Lebanon",
            "description": "Building on my bachelor's education, I earned my <strong>Engineering degree in Computer Science</strong>, specializing in <strong>Software Architecture</strong>, from <a href='https://www.cnam-liban.fr/cnam-liban/' target='_blank'>CNAM Lebanon</a>. This advanced program, which follows the initial program of <a href='https://www.cnam.fr/' target='_blank'>CNAM Paris</a>, deepened my expertise in multiple areas such as <strong> software architecture, database management</strong>., but also <strong>cultural knowledge</strong> and <strong>communication skills</strong> essential competencies for engineers aspiring to get higher positions. This program provided a strong technical foundation for my career, especially since it required students to work professionally while pursuing their studies. This is a core aspect of CNAM’s mission to support working professionals in advancing their education."
        },
        {
            "title": "Bachelor's Degree (2012 - 2016)",
            "institute": "Le CNAM",
            "location": "Nahr Brahim, Lebanon",
            "description": "I completed my Bachelor's degree in Computer Science from  <a href='https://www.cnam-liban.fr/presentation/les-centres/' target='_blank'>CNAM Nahr Brahim</a>. This foundational program provided me with a comprehensive understanding of core computer science concepts, setting the stage for my further studies and professional growth. It was a challenging yet valuable experience where I mastered the fundamentals of programming. I further enriched my studies by completing a 6 month internship at the Internal Security Forces in Beirut which helped me gain real-world experience while studying."
        }
    ],
    "experienceIntro": "Over the years, I’ve gained practical experience in both research and industry, working across diverse fields such as insurance, national security, education, and metaprogramming. From internships to full-time positions, I have worked with diverse teams, tackling real-world problems and building my skills:",
    "experience": [
        {
            "title": "Research Engineer (2025–Present)",
            "institute": "Berger-Levrault",
            "location": "Lyon, France",
            "description": "I currently work as a <strong>Research Engineer</strong> at <a href='https://www.berger-levrault.com/fr/' target='_blank'>Berger-Levrault</a>, specializing in <strong>polyglot software analysis</strong>. As part of the <a href='https://www.research-bl.com/team/' target='_blank'>DRIT</a> team (Direction de la Recherche et de l'Innovation Technologique), our mission is research-focused, primarily serving Berger-Levrault’s developers. In my role, I merge <strong>academic research</strong> such as reading, authoring, and co-authoring <a href='https://www.research-bl.com/publications/' target='_blank'>research papers</a> with <strong>engineering practices</strong> which includes developing and collaborating on <a href='https://github.com/Evref-BL/' target='_blank'>open-source projects</a>."
        },
        {
            "title": "PhD Candidate (2021–2024)",
            "institute": "Inria",
            "location": "Lille, France",
            "description": "During my PhD, I focused on researching <strong>software analysis</strong>. I learned a new programming language called <a href='https://pharo.org/' target='_blank'>Pharo</a>, because it has powerful tools for analyzing software called <a href='https://moosetechnology.org/' target='_blank'>Moose</a> (<a href='https://modularmoose.org/' target='_blank'>another link</a>), built on years of research. As a PhD student, I didn’t just do research, I also created <strong>open-source projects</strong> to support my thesis. One of my projects is <strong><a href='https://github.com/alesshosry/MoTion' target='_blank'>MoTion</a></strong>, a pattern-matching tool now used by many developers in the community as their initial searching engine. I also built <strong><a href='https://github.com/alesshosry/Adonis' target='_blank'>Adonis</a></strong>, which uses MoTion to detect what I called 'external dependencies' (like cross-language links in mixed-language software). I chose this name because my work expanded to cover polyglot software, multi-tier programs, and documentation. I also published <a href='https://scholar.google.com/citations?user=SWkBYn0AAAAJ&hl=fr&oi=ao' target='_blank'>research papers</a> and presented at different conferences."
        },
        {
            "title": "Fullstack Developer (2016–2021)",
            "institute": "Bankers Assurance SAL",
            "location": "Sil El Fil, Lebanon",
            "description": "During my time in industry, I worked as a full-stack developer, staying up-to-date with evolving practices in software architecture and development. My responsibilities included building websites from scratch, updating existing ones, developing web services, creating desktop applications and manage databases. I also tested mobile applications developed by external vendors and ensured smooth communication with Bankers solutions by developing RESTful services. At that time, I gained experience with established technologies while also having the opportunity to learn and master new ones, such as Angular, .NET Core, and Bootstrap. This experience played a key role in shaping my vision and ultimately led me to pursue a path in academic research."
        },
        {
            "title": "Trainee (2015)",
            "institute": "Internal Security Forces",
            "location": "Ashrafiyeh, Lebanon",
            "description": "This was my first real experience in programming. I worked with a team of four students under the supervision of an ISF officer. It was the first time I discovered what Java was truly capable of, my first time communicating with experts online through <a href='https://stackoverflow.com/users/5184636/aless-hosry' target='_blank'>Stack Overflow</a>, and my first time learning a new technology (Android) and how to develop Android mobile apps. This internship was a true learning experience, and by the end of it, I was able of developing three different mobile applications."
        }
    ]
}