{
    "quote": "Curiosity and a positive attitude can take you places!",
    "bio": "Hello and welcome. I’m <b>Aless HOSRY</b>, a research engineer specialised in software analysis. I invite you to browse through my website to learn more about my professional journey, explore my portfolio, and connect with me on social media. Let’s connect and collaborate to create something meaningful.",
    "educationIntro": "My academic journey in computer science spans a range of degrees, each building a solid foundation in the field and shaping my expertise in software engineering:",
    "education": [
        {
            "title": "PhD in Computer Science (2021 - 2024)",
            "description": "I completed my PhD in Computer Science, specializing in External Dependencies, as part of the EVREF team at INRIA Lille. My research focused on detecting and analyzing external dependencies in heterogeneous software systems, resulting in several published papers and presentations at international conferences. This experience enhanced my technical expertise and reinforced my ability to independently tackle complex research challenges."
        },
        {
            "title": "Engineering Degree (2017 - 2019)",
            "description": "Building upon my bachelor's education, I pursued and obtained my Engineering degree in Computer Science from CNAM Lebanon. This advanced program deepened my knowledge in areas such as algorithms, software engineering, and database management, providing a strong technical foundation for my research career."
        },
        {
            "title": "Bachelor's Degree (2012 - 2016)",
            "description": "I completed my Bachelor's degree in Computer Science from CNAM Lebanon. This foundational program provided me with a comprehensive understanding of core computer science concepts, setting the stage for my further studies and professional growth."
        }
    ],
    "experienceIntro": "Over the years, I've had the opportunity to gain practical experience in various professional settings. From internships to full-time positions, I have worked with diverse teams, tackling real-world problems and building my skills. These experiences have sharpened my abilities and taught me the value of collaboration and adaptability:",
    "experience": [
        {
            "title": "Research Engineer (2025–Present)",
            "description": "I currently work as a research engineer at Berger-Levrault, specializing in software analysis. My role allows me to merge academic insights with engineering practices. And no, I don't do AI!"
        },
        {
            "title": "PhD Candidate (2021–2024)",
            "description": "During my PhD, I focused on academic research in software analysis. I created innovative libraries like Adonis and MoTion, developed in Pharo, and collaborated with industry to analyze large-scale projects."
        },
        {
            "title": "Fullstack Engineer (2016–2021)",
            "description": "I worked in industry as a software engineer, staying current with evolving practices in software architecture and development. I mastered technologies such as Angular, Oracle SQL, .NET Core, and RESTful APIs."
        }
    ]
}